In [59]:
import pandas as pd
import numpy as np

#   Read a CSV
https://vincentarelbundock.github.io/Rdatasets/datasets.html

In [48]:
df=pd.read_csv("BankWages.csv")

In [19]:
df

     Unnamed: 0     job  education  gender minority
0             1  manage         15    male       no
1             2   admin         16    male       no
2             3   admin         12  female       no
3             4   admin          8  female       no
4             5   admin         15    male       no
..          ...     ...        ...     ...      ...
469         470   admin         12    male      yes
470         471   admin         15    male      yes
471         472   admin         15    male       no
472         473   admin         12  female       no
473         474   admin         12  female       no

[474 rows x 5 columns]

# Rename Columns

In [21]:
df.rename(columns={"education": "qualification"})

     Unnamed: 0     job  qualification  gender minority
0             1  manage             15    male       no
1             2   admin             16    male       no
2             3   admin             12  female       no
3             4   admin              8  female       no
4             5   admin             15    male       no
..          ...     ...            ...     ...      ...
469         470   admin             12    male      yes
470         471   admin             15    male      yes
471         472   admin             15    male       no
472         473   admin             12  female       no
473         474   admin             12  female       no

[474 rows x 5 columns]

# Delete Columns

In [24]:
df.drop(columns=["minority"], inplace=True)

In [25]:
df

     Unnamed: 0     job  education  gender
0             1  manage         15    male
1             2   admin         16    male
2             3   admin         12  female
3             4   admin          8  female
4             5   admin         15    male
..          ...     ...        ...     ...
469         470   admin         12    male
470         471   admin         15    male
471         472   admin         15    male
472         473   admin         12  female
473         474   admin         12  female

[474 rows x 4 columns]

# Add new Columns

In [27]:
df["my_education"]=df["education"]

In [28]:
df

     Unnamed: 0     job  education  gender  my_education
0             1  manage         15    male            15
1             2   admin         16    male            16
2             3   admin         12  female            12
3             4   admin          8  female             8
4             5   admin         15    male            15
..          ...     ...        ...     ...           ...
469         470   admin         12    male            12
470         471   admin         15    male            15
471         472   admin         15    male            15
472         473   admin         12  female            12
473         474   admin         12  female            12

[474 rows x 5 columns]

# Create a DataFrame

## From a list of lists

In [29]:
data = [[1, 2, "A"], 
        [3, 4, "B"]]

In [30]:
data

[[1, 2, 'A'], [3, 4, 'B']]

In [31]:
df = pd.DataFrame(data, 
                  columns = ["col_1", "col_2", "col_3"])

In [32]:
df

   col_1  col_2 col_3
0      1      2     A
1      3      4     B

## From a dictionary

In [41]:
data_dict = {'col_1': [1, 2], 
        'col_2': [3, 4], 
        'col_3': ["A", "B"]}

In [42]:
data_dict

{'col_1': [1, 2], 'col_2': [3, 4], 'col_3': ['A', 'B']}

In [43]:
df = pd.DataFrame(data=data)

In [44]:
df

   col1  col2 col3
0     1     3    A
1     2     4    B

# Storing a DataFrame to a CSV

In [45]:
df.to_csv("my_new_file.csv")

# The Shape of the DataFrame

In [47]:
df.shape

(2, 3)

In [49]:
df

     Unnamed: 0     job  education  gender minority
0             1  manage         15    male       no
1             2   admin         16    male       no
2             3   admin         12  female       no
3             4   admin          8  female       no
4             5   admin         15    male       no
..          ...     ...        ...     ...      ...
469         470   admin         12    male      yes
470         471   admin         15    male      yes
471         472   admin         15    male       no
472         473   admin         12  female       no
473         474   admin         12  female       no

[474 rows x 5 columns]

In [50]:
df.shape

(474, 5)

# Head and Tail

In [52]:
df.head(10)

   Unnamed: 0     job  education  gender minority
0           1  manage         15    male       no
1           2   admin         16    male       no
2           3   admin         12  female       no
3           4   admin          8  female       no
4           5   admin         15    male       no
5           6   admin         15    male       no
6           7   admin         15    male       no
7           8   admin         12  female       no
8           9   admin         15  female       no
9          10   admin         12  female       no

In [54]:
df.tail()

     Unnamed: 0    job  education  gender minority
469         470  admin         12    male      yes
470         471  admin         15    male      yes
471         472  admin         15    male       no
472         473  admin         12  female       no
473         474  admin         12  female       no

# Displaying information about the DataFrame

In [55]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 474 entries, 0 to 473
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  474 non-null    int64
 1   job         474 non-null    object
 2   education   474 non-null    int64
 3   gender      474 non-null    object
 4   minority    474 non-null    object
dtypes: int64(2), object(3)
memory usage: 18.6+ KB

In [56]:
df.columns

Index(['Unnamed: 0', 'job', 'education', 'gender', 'minority'], dtype='object')

In [57]:
df.describe()

       Unnamed: 0   education
count  474.000000  474.000000
mean   237.500000   13.491561
std    136.976275    2.884846
min      1.000000    8.000000
25%    119.250000   12.000000
50%    237.500000   12.000000
75%    355.750000   15.000000
max    474.000000   21.000000

# Filling NaN values

In [63]:
df = pd.DataFrame([[1, 2, "A"], [np.nan, 4, "B"]], 
                  columns = ["col1", "col2", "col3"])
print(df)

   col1  col2 col3
0   1.0     2    A
1   NaN     4    B

In [61]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   col1    1 non-null      float64
 1   col2    2 non-null      int64
 2   col3    2 non-null      object
dtypes: float64(1), int64(1), object(1)
memory usage: 176.0+ bytes

In [64]:
df.fillna(100, inplace = True)
print(df)

    col1  col2 col3
0    1.0     2    A
1  100.0     4    B

# Joining DataFrames

In [83]:
df_1 = pd.DataFrame([[1, 12, "A"], [56, 6, "c"]], 
                  columns = ["apples", "oranges", "col3"])

df_2 = pd.DataFrame([[1, 2, "A"], [45, 8, "B"]], 
                  columns = ["grapes", "mangoes", "col3"])

In [84]:
df_1.head()

   apples  oranges col3
0       1       12    A
1      56        6    c

In [85]:
df_2.head()

   grapes  mangoes col3
0       1        2    A
1      45        8    B

In [86]:
df_3=pd.merge(df_1, df_2, on = "col3")

In [87]:
df_3

   apples  oranges col3  grapes  mangoes
0       1       12    A       1        2

# Sorting a DataFrame

In [89]:
df = pd.DataFrame([[1, 2,  "A"], 
                   [5, 8,  "B"], 
                   [3, 10, "B"]], 
                  columns = ["col1", "col2", "col3"])

In [91]:
df

   col1  col2 col3
0     1     2    A
1     5     8    B
2     3    10    B

In [92]:
print(df.sort_values("col1"))

   col1  col2 col3
0     1     2    A
2     3    10    B
1     5     8    B

# Filtering a DataFrame

In [98]:
df = pd.DataFrame([[1, 2,  "A"], 
                   [5, 8,  "B"], 
                   [3, 10, "B"]], 
                  columns = ["col1", "col2", "col3"])

In [94]:
df

   col1  col2 col3
0     1     2    A
1     5     8    B
2     3    10    B

### Getting entire Column

In [96]:
df_new=df["col2"]

In [97]:
df_new

0     2
1     8
2    10
Name: col2, dtype: int64

### Boolean Filtering

In [99]:
print(df[df["col1"] >= 3])

   col1  col2 col3
1     5     8    B
2     3    10    B

### Using isin()

In [100]:
df = pd.DataFrame([[1, 2,  "A"], 
                   [5, 8,  "B"], 
                   [3, 10, "C"]], 
                  columns = ["col1", "col2", "col3"])

In [101]:
df

   col1  col2 col3
0     1     2    A
1     5     8    B
2     3    10    C

In [102]:
filter_list = ["A", "C"]
print(df[df["col3"].isin(filter_list)])

   col1  col2 col3
0     1     2    A
2     3    10    C

### Filter by Label Name

In [105]:
df = pd.DataFrame([[6, 5,  10], 
                   [5, 8,  6], 
                   [3, 10, 4], 
                  [3, 11, 40]], 
                  columns = ["Maths", "Science", "English"],
                  index = ["John", "Mark", "Peter", "John"])

print(df)

       Maths  Science  English
John       6        5       10
Mark       5        8        6
Peter      3       10        4
John       3       11       40

In [106]:
df.loc["John"]

      Maths  Science  English
John      6        5       10
John      3       11       40

In [107]:
df.loc["John", ["Maths", "Science"]]

      Maths  Science
John      6        5
John      3       11

### Filter by Index

In [110]:
df.iloc[3]

Maths       3
Science    11
English    40
Name: John, dtype: int64

# Grouping a DataFrame

In [112]:
df = pd.DataFrame([[1, 2,  "A"], 
                   [5, 8,  "B"], 
                   [3, 10, "B"]], 
                  columns = ["col_1", "col_2", "col_3"])

In [114]:
df.head()

   col_1  col_2 col_3
0      1      2     A
1      5      8     B
2      3     10     B

In [116]:
df.groupby("col_3").agg({"col_1":sum, "col_2":max})

       col_1  col_2
col_3
A          1      2
B          8     10

# Get Unique Values in a DataFrame

In [117]:
df = pd.DataFrame([[1, 2,  "A"], 
                   [5, 8,  "B"], 
                   [3, 10, "A"]], 
                  columns = ["col1", "col2", "col3"])

In [118]:
df

   col1  col2 col3
0     1     2    A
1     5     8    B
2     3    10    A

In [122]:
df["col3"].unique()

array(['A', 'B'], dtype=object)

In [124]:
df["col2"].nunique()

3

# Apply Function to a DataFrame

In [125]:
def my_sum(my_rows):
    return my_rows.col_1 + my_rows.col_2

In [126]:
df = pd.DataFrame([[1, 2], 
                   [5, 8], 
                   [3, 9]], 
                  columns = ["col_1", "col_2"])

In [127]:
df.head()

   col_1  col_2
0      1      2
1      5      8
2      3      9

In [128]:
df["col_3"] = df.apply(my_sum, axis=1)
print(df)

   col_1  col_2  col_3
0      1      2      3
1      5      8     13
2      3      9     12

In [129]:
def square_col(num):
    return num**2

In [130]:
df["col_4"] = df.col_1.apply(square_col)

In [131]:
df

   col_1  col_2  col_3  col_4
0      1      2      3      1
1      5      8     13     25
2      3      9     12      9

# Check Duplicate Values

In [132]:
df = pd.DataFrame([[1, "A"], 
                   [2, "B"], 
                   [1, "A"]], 
                  columns = ["col1", "col2"])

In [133]:
df

   col1 col2
0     1    A
1     2    B
2     1    A

In [134]:
df.duplicated(keep=False)

0     True
1    False
2     True
dtype: bool

# Find distribution of values in a column

In [137]:
df = pd.DataFrame([[1, "A"], 
                   [2, "B"], 
                   [1, "A"]], 
                  columns = ["col_1", "col_2"])

In [136]:
df

   col1 col2
0     1    A
1     2    B
2     1    A

In [138]:
print(df.value_counts("col_2"))

col_2
A    2
B    1
dtype: int64